//
//  LorText.swift
//  HW30
//
//  Created by Oleg Podrez on 13.10.24.
//

import Foundation

let lorText = [
    "Главный герой, {name}, живёт обычной жизнью на далёкой колонизированной планете. Он — рабочий в шахте, занимающийся рутинной деятельностью, но его преследуют сны о том, как он сражается в далёких мирах в роли агента. Однажды он решает посетить загадочную компанию «Виртум», которая предлагает клиентам воспоминания о других жизнях.",
    
    "{name} решается на процедуру по внедрению воспоминаний, но что-то идёт не так. Теперь он не уверен, что является настоящим — он агент сопротивления или простой рабочий? Его жизнь превращается в череду опасных событий, где враги преследуют его, а союзники сомневаются в его настоящей личности. Теперь только твои решения приведут тебя к правде кем ты являешься или к твоей погибели.",

    

    "{name} — мужчина 35 лет, физически крепкий, с короткими темными волосами и серьёзным взглядом. Его внешность типична для рабочего, однако внутри его постоянно гложет ощущение, что он создан для чего-то большего. В глубине души он мечтает о приключениях и значимых свершениях, хотя никогда не имел возможности покинуть свою привычную, монотонную жизнь. Марк — человек с сильной волей, но порой его сомнения и неуверенность заставляют его сомневаться в собственных действиях.",

    "Он из тех, кто всегда следует своему чувству справедливости, но когда ему приходится выбирать между безопасностью и правдой, он может быть готов пойти на риск ради более высокой цели. Однако внезапное осознание, что вся его жизнь могла быть ложью, ставит под угрозу его внутренние убеждения. Он теперь не знает, можно ли доверять даже собственным воспоминаниям.",
    
    "Главный герой только что проснулся после процедуры в «Виртуме». Взрыв раздаётся неподалёку, дверь распахивается, и в комнату врываются вооружённые агенты."
]
